<meta http-equiv="Content-Type" content="text/html; charset=utf-8">
<html>
	<head>
		<title>OpenShop</title>
	</head>
	<body>
		<h2>&#1053;&#1072;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1089; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1085;&#1077;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1075;&#1086; &#1089;&#1091;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074;</h2>
		<p>
			<b>&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;</b> &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1080;&#1085;&#1099; L<sub>max</sub> &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <i>&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;</i>.
			&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; open shop, &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1081; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <i>&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;</i>. 
			&#1055;&#1086;&#1076;&#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1086;&#1074; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <i>&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084;</i>. &#1045;&#1089;&#1083;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; 
			&#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1087;&#1086;&#1083;&#1080;&#1085;&#1086;&#1084;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1090;&#1088;&#1091;&#1076;&#1086;&#1077;&#1084;&#1082;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1083;&#1103; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1080;&#1079;
			&#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090; &#1077;&#1075;&#1086; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; (&#1072; &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;)
			&#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;, &#1090;&#1086; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; <i>&#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;-&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084;</i>.
		</p>
		<p>
		<b>&#1058;&#1077;&#1086;&#1088;&#1077;&#1084;&#1072; </b> &#1055;&#1091;&#1089;&#1090;&#1100; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; A, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1083;&#1103; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; m &#8805; 2 &#1080;
			&#1083;&#1102;&#1073;&#1086;&#1075;&#1086; s-&#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1072; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; <img src="images/5.png" /> &#1089; &#1090;&#1088;&#1091;&#1076;&#1086;&#1077;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100;&#1102; T<sub>A</sub>(m&#8722;1, n)
			&#1088;&#1077;&#1096;&#1072;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1095;&#1091; &#1053;&#1057;&#1042;1(m &#8722; 1) &#1089; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1086;&#1094;&#1077;&#1085;&#1082;&#1086;&#1081;
			<div><img src="images/6.png" /> (1)</div>
			&#1058;&#1086;&#1075;&#1076;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1089;&#1103;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080; open shop &#1089; m
			&#1084;&#1072;&#1096;&#1080;&#1085;&#1072;&#1084;&#1080; &#1080; n &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1084;&#1080;, &#1091;&#1076;&#1086;&#1074;&#1083;&#1077;&#1090;&#1074;&#1086;&#1088;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1102;
			<div><img src="images/7.png" /> (2)</div>
			&#1089; &#1090;&#1088;&#1091;&#1076;&#1086;&#1077;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100;&#1102; O(T<sub>A</sub>(m&#8722;1, n) + mn) &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090; &#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1076;&#1083;&#1080;&#1085;&#1099; L<sub>max</sub>.
		</p>		
		<p>
			<b>&#1044;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1090;&#1074;&#1086;.</b>&#1055;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; A &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; 
			&#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1074; &#1079;&#1072;&#1076;&#1072;&#1095;&#1077; OS &#1087;&#1088;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; (2) &#1080; &#1074; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103;&#1093; &#1090;&#1077;&#1086;&#1088;&#1077;&#1084;&#1099; 1.
		</p>
		<p><b>&#1040;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; A</b></p>
		<p>
			<b>&#1064;&#1072;&#1075; 1.</b> &#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1103; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1099; L<sub>max</sub> &#1080; p<sub>max</sub>, &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1084; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; 
			&#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1083;&#1080;&#1089;&#1100; &#1088;&#1072;&#1074;&#1077;&#1085;&#1089;&#1090;&#1074;&#1072; (22.9). (&#1058;&#1088;&#1091;&#1076;&#1086;&#1077;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100; &#1096;&#1072;&#1075;&#1072; &#1088;&#1072;&#1074;&#1085;&#1072;
			O(mn).) &#1063;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;, &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1097;&#1080;&#1093; &#1086;&#1090; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085; {p<sub>ji</sub>}, &#1073;&#1091;&#1076;&#1077;&#1084;
			&#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1074;&#1077;&#1085;&#1089;&#1090;&#1074;&#1072; (22.9) &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1083;&#1080;&#1089;&#1100; &#1076;&#1083;&#1103; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1099; (p<sub>ji</sub>).
			&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1084; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1099; <img src="images/8.png" />, &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; (22.11). &#1048;&#1079; (22.9) &#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103;
			&#1085;&#1086;&#1088;&#1084;&#1099; s<sup>^</sup> &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1091; p<sub>max</sub> &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100; &#1079;&#1072; &#1085;&#1086;&#1074;&#1091;&#1102; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1091; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;,
			&#1090;&#1086; &#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; D = {d<sub>1</sub>,..., d<sub>n</sub>} &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; s^-&#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1084; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; <img src="images/9.png" />.
		</p>
		<p>
			<b>&#1064;&#1072;&#1075; 2.</b> &#1055;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1074; &#1082; &#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091; D &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; A &#1080;&#1079; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1103; &#1090;&#1077;&#1086;&#1088;&#1077;&#1084;&#1099;, &#1085;&#1072;&#1081;&#1076;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1091; 
			&#960; = (&#960;<sub>1</sub>,..., &#960;<sub>n</sub>), &#1079;&#1072;&#1076;&#1072;&#1102;&#1097;&#1091;&#1102; &#1085;&#1077;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086;&#1077; &#1089;&#1091;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1077;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1080;&#1079; D &#1089;&#1077;&#1084;&#1077;&#1081;&#1089;&#1090;&#1074;&#1077;
			&#1087;&#1086;&#1083;&#1091;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;
			<div><img src="images/10.png" /><div>
			&#1075;&#1076;&#1077; <img src="images/11.png" />,
			<div><img src="images/12.png" /> (3)</div>
			&#1058;&#1088;&#1091;&#1076;&#1086;&#1077;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100; &#1096;&#1072;&#1075;&#1072; 2 &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089; &#1090;&#1088;&#1091;&#1076;&#1086;&#1077;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100;&#1102; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1072; A, &#1090;.&#1077;. &#1088;&#1072;&#1074;&#1085;&#1072; O(T<sub>A</sub>(m&#8722;1,n)).
		</p>
		<p>
			<b>&#1064;&#1072;&#1075; 3.</b> &#1044;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1085;&#1072; &#1096;&#1072;&#1075;&#1077; 1, &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1084; &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;
			&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091; &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084;&#1091;.
			&#1044;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1084;&#1072;&#1096;&#1080;&#1085;&#1099; M<sub>i</sub> &#8712; M &#1087;&#1086;&#1089;&#1090;&#1088;&#1086;&#1080;&#1084; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; S<sub>i</sub> , &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1077;&#1077;&#1089;&#1103;
			&#1074; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; 0 &#1080; &#1090;&#1072;&#1082;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090; J<sub>j</sub> &#8712; J &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1088;&#1103;&#1076; &#1073;&#1077;&#1079; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1077;&#1074; &#1074;
			&#1086;&#1076;&#1085;&#1086;&#1084; &#1080; &#1090;&#1086;&#1084; &#1078;&#1077; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1086;&#1081; &#960;. &#1048;&#1079; (22.9) &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1082;&#1072;&#1078;&#1076;&#1072;&#1103;
			&#1084;&#1072;&#1096;&#1080;&#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1085;&#1077;&#1087;&#1088;&#1077;&#1088;&#1099;&#1074;&#1085;&#1086; &#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1072;&#1083;&#1077; [0, L<sub>max</sub> ]. (&#1054;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1073;&#1086;&#1088; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1081;
			{S<sub>1</sub>,...,S<sub>m</sub> }, &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;, &#1085;&#1077; &#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086;&#1075;&#1086; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;.)
			&#1042; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1101;&#1090;&#1080; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1090;&#1077;&#1088;&#1087;&#1103;&#1090; &#1088;&#1103;&#1076; &#1089;&#1076;&#1074;&#1080;&#1075;&#1086;&#1074; &#1074;&#1087;&#1088;&#1072;&#1074;&#1086;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1095;&#1072;&#1089;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103;, 
			&#1074;&#1099;&#1093;&#1086;&#1076;&#1103;&#1097;&#1072;&#1103; &#1079;&#1072; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1072;&#1083;&#1072; [0, L<sub>max</sub> ], &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1089;&#1077;&#1082;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103;
			&#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1072;&#1083;&#1072;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1084;&#1072;&#1096;&#1080;&#1085; M<sub>i</sub> &#8712; M &#1091;&#1076;&#1086;&#1073;&#1085;&#1086; 
			&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1084;&#1080;&#1089;&#1103; &#1085;&#1072; &#8220;&#1073;&#1072;&#1088;&#1072;&#1073;&#1072;&#1085;&#1077;&#8221; &#1089; &#1076;&#1083;&#1080;&#1085;&#1086;&#1081; &#1086;&#1082;&#1088;&#1091;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1088;&#1072;&#1074;&#1085;&#1086;&#1081; L<sub>max</sub> , &#1075;&#1076;&#1077;
			&#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; Si &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1097;&#1080;&#1084;&#1089;&#1103; "&#1082;&#1086;&#1083;&#1100;&#1094;&#1086;&#1084;" K<sub>i</sub> . &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084;
			&#1089;&#1095;&#1080;&#1090;&#1072;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086; K<sub>1</sub> &#1086;&#1089;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1076;&#1074;&#1080;&#1078;&#1085;&#1099;&#1084; &#1080; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; S<sub>1</sub> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1086;&#1095;&#1082;&#1091;
			&#1086;&#1090;&#1089;&#1095;&#1077;&#1090;&#1072; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;. &#1055;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;
			<div><img src="images/13.png" /> (4)<div>
			&#1075;&#1076;&#1077; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1099; P<sup>k</sup><sub>&#960;</sub>(i,i+1) &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; (22.13), &#1072; &#1087;&#1088;&#1080; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; P<sup>k</sup><sub>&#960;</sub>(m,m+1)
			&#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1077;&#1084;, &#1095;&#1090;&#1086; <img src="images/15.png" />
			&#1055;&#1091;&#1089;&#1090;&#1100; k<sup>&#8727;</sup> &#8212; (&#1087;&#1077;&#1088;&#1074;&#1086;&#1077;) &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; k, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1076;&#1086;&#1089;&#1090;&#1080;&#1075;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1091;&#1084; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1099;, &#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1081; 
			&#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; (4) &#1087;&#1088;&#1080; i=1. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;,
			<div><img src="images/14.png" /> (5)<div>
		</p>
		<p>
			&#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084; m&#8722;1 &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1086;&#1074; (&#1073;&#1091;&#1076;&#1077;&#1084; &#1085;&#1091;&#1084;&#1077;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1086;&#1090; 2 &#1076;&#1086; m) &#1082;&#1086;&#1083;&#1077;&#1094;
			K<sub>2</sub> , . . . , K<sub>m</sub> , &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1103; &#1082;&#1086;&#1083;&#1100;&#1094;&#1086; K<sub>1</sub> &#1085;&#1072; &#1084;&#1077;&#1089;&#1090;&#1077;.
		</p>
		<p>
			&#1055;&#1054;&#1042;&#1054;&#1056;&#1054;&#1058; 2. &#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1077;&#1084; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1080;&#1079; &#1082;&#1086;&#1083;&#1077;&#1094; K<sub>2</sub> , . . . , K<sub>m</sub> &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; &#1085;&#1072; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1091; &#8710;<sub>1</sub>, 
			&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1103; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084; &#1080;&#1093; &#1074;&#1079;&#1072;&#1080;&#1084;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;. &#1057; &#1091;&#1095;&#1077;&#1090;&#1086;&#1084; (5), &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; <img src="images/16.png" /> &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1090;
			&#1089; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; <img src="images/17.png" /> &#1085;&#1072; &#1084;&#1072;&#1096;&#1080;&#1085;&#1077; M<sub>1</sub> &#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#960;<sub>k&#8727;-1</sub>
			&#1085;&#1072; &#1084;&#1072;&#1096;&#1080;&#1085;&#1077; M<sub>2</sub>. &#1052;&#1086;&#1084;&#1077;&#1085;&#1090; t<sup>&#8727;</sup> &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1084; &#1079;&#1072; &#1073;&#1091;&#1076;&#1091;&#1097;&#1091;&#1102; &#1090;&#1086;&#1095;&#1082;&#1091; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;
			&#8220;&#1073;&#1072;&#1088;&#1072;&#1073;&#1072;&#1085;&#1077;&#8221;.
		</p>
		<p>
			&#1055;&#1054;&#1042;&#1054;&#1056;&#1054;&#1058; &#957; (&#957; = 3, . . . , m). &#1055;&#1086;&#1074;&#1077;&#1088;&#1085;&#1077;&#1084; &#1082;&#1072;&#1078;&#1076;&#1086;&#1077; &#1080;&#1079; &#1082;&#1086;&#1083;&#1077;&#1094; K<sub>&#957;</sub> , . . . , K<sub>m</sub> &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; &#1085;&#1072; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1091;
			&#8710;<sub>&#957;&#8722;1</sub> , &#1080; &#1079;&#1072;&#1090;&#1077;&#1084; &#8212; &#1077;&#1097;&#1077; &#1085;&#1072; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1091; &#948;<sub>&#957;&#8722;1</sub> &#8805; 0 (&#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;),
			&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1091;&#1102; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; t<sup>&#8727;</sup> &#1089;&#1086;&#1074;&#1087;&#1072;&#1083; &#1089; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1090;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;
			&#1084;&#1072;&#1096;&#1080;&#1085;&#1099; M<sub>&#957;</sub>. &#1071;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086;
			<div><img src="images/18.png" /> (6)<div>
		</p>
		<p>
			&#1057;&#1091;&#1084;&#1084;&#1072;&#1088;&#1085;&#1099;&#1081; (&#1087;&#1086; &#1074;&#1089;&#1077;&#1084; m&#8722;1 &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1072;&#1084;) &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090; &#1082;&#1086;&#1083;&#1100;&#1094;&#1072; K<sub>m</sub> &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;
			&#1082;&#1086;&#1083;&#1100;&#1094;&#1072; K<sub>1</sub> &#1088;&#1072;&#1074;&#1077;&#1085; <img src="images/20.png" /> &#1095;&#1090;&#1086; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086; &#1077;&#1075;&#1086; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1091; &#1074;&#1083;&#1077;&#1074;&#1086; &#1085;&#1072;
			L<sub>max</sub> &#8722; &#8710;' , &#1080;&#1083;&#1080; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1091; &#1082;&#1086;&#1083;&#1100;&#1094;&#1072; K<sub>1</sub> &#1074;&#1087;&#1088;&#1072;&#1074;&#1086; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; K<sub>m</sub> &#1085;&#1072; &#1101;&#1090;&#1091; &#1078;&#1077; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1091;.
			&#1053;&#1077;&#1090;&#1088;&#1091;&#1076;&#1085;&#1086; &#1091;&#1073;&#1077;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1077;&#1089;&#1083;&#1080;
			<div><img src="images/19.png" /> (7)<div>
			&#1090;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1074;&#1089;&#1077;&#1093; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1086;&#1074; &#1082;&#1086;&#1083;&#1077;&#1094; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; S &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084; &#1085;&#1072;
			&#1073;&#1072;&#1088;&#1072;&#1073;&#1072;&#1085;&#1077;. &#1069;&#1090;&#1086; &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1072;&#1083;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1083;&#1102;&#1073;&#1099;&#1093; &#1076;&#1074;&#1091;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080; &#1090;&#1086;&#1081;
			&#1078;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103;.
		</p>
		<p>
			&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079; S &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1086;&#1075;&#1086; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1080;&#1085;&#1099; L<sub>max</sub> &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; 
			&#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1082;&#1086;&#1083;&#1100;&#1094;&#1072; &#1074; &#1090;&#1086;&#1095;&#1082;&#1077; t<sup>&#8727;</sup> . &#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1085;&#1080; &#1076;&#1083;&#1103; &#1082;&#1072;&#1082;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1080;&#1085;&#1090;&#1077;&#1088;&#1074;&#1072;&#1083;
			&#1077;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1079;&#1088;&#1077;&#1079;&#1072;&#1085; (&#1095;&#1090;&#1086; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1077;&#1085;&#1086; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1072;&#1084;&#1080; {&#948;<sub>&#957;</sub>} &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093;
			&#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1086;&#1074;), &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084;. &#1054;&#1095;&#1077;&#1074;&#1080;&#1076;&#1085;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090;
			&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084; &#1080; &#1076;&#1083;&#1103; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1084;&#1072;&#1090;&#1088;&#1080;&#1094;&#1099; (&#1073;&#1086;&#1083;&#1077;&#1077; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1093;) &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1077;&#1081;&#1089;&#1103; &#1085;&#1072; &#1074;&#1093;&#1086;&#1076;&#1077; &#1076;&#1086; &#1096;&#1072;&#1075;&#1072; 1.
		</p>
		<p>
			&#1058;&#1088;&#1091;&#1076;&#1086;&#1077;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100; &#1096;&#1072;&#1075;&#1072; 3 &#1089;&#1082;&#1083;&#1072;&#1076;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1079; &#1090;&#1088;&#1091;&#1076;&#1086;&#1077;&#1084;&#1082;&#1086;&#1089;&#1090;&#1080; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085; <img src="images/20.png" /> 
			&#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; (22.12), &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085; <img src="images/21.png" /> &#8212; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086;
			(22.13), &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085; &#8710;<sub>i</sub> &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1072; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1086;&#1083;&#1100;&#1094;&#1072; K<sub>i</sub> , i &#8712; N<sub>m</sub> , &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1085;&#1086; (4),
			&#1080; &#1085;&#1072;&#1082;&#1086;&#1085;&#1077;&#1094;, &#1080;&#1079; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085; &#948;<sub>i</sub> &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;&#1072; &#1101;&#1090;&#1080;&#1093; &#1082;&#1086;&#1083;&#1077;&#1094;. &#1071;&#1089;&#1085;&#1086;, &#1095;&#1090;&#1086;
			&#1074;&#1089;&#1077; &#1101;&#1090;&#1080; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099; &#1079;&#1072; O(mn) &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081;.
		</p>
		<p>
			&#1040;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; A &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;.
		</p>
	</body>
</html>